package com.example.projectandroid.db;

import android.content.ContentValues;
import android.content.Context;
import android.database.sqlite.SQLiteDatabase;
import android.database.sqlite.SQLiteOpenHelper;

public class DatabaseHelper extends SQLiteOpenHelper {

    private static final String DATABASE_NAME = "nakornpathom_tourism.db";
    private static final int DATABASE_VERSION = 1;

    public static final String TABLE_NAME = "tourism_location";
    public static final String COL_ID = "_id";
    public static final String COL_TITLE = "title";
    public static final String COL_LOCATION = "location";
    public static final String COL_DETAIL = "detail";
    public static final String COL_IMAGE = "image";

    private static final String SQL_CREATE_TABLE
            = "CREATE TABLE " + TABLE_NAME + "("
            + COL_ID + " INTEGER PRIMARY KEY AUTOINCREMENT,"
            + COL_TITLE + " TEXT,"
            + COL_LOCATION + " TEXT,"
            + COL_DETAIL + " TEXT,"
            + COL_IMAGE + " TEXT "
            + ")";


    public DatabaseHelper(Context context) {
        super(context, "nakornpathom_tourism.db", null, 1);
    }

    @Override
    public void onCreate(SQLiteDatabase db) {
        db.execSQL(SQL_CREATE_TABLE);

        ContentValues cv = new ContentValues();
        cv.put(COL_TITLE, "วัดพระปฐมเจดีย์ราชวรมหาวิหาร");
        cv.put(COL_LOCATION, "ตำบลพระปฐมเจดีย์ อำเภอเมืองนครปฐม จังหวัดนครปฐม 73000");
        cv.put(COL_DETAIL, "    องค์พระปฐมเจดีย์ เป็นปูชนียสถานอันสำคัญของประเทศไทย อยู่ภายในวัดพระปฐมเจดีย์ราชวรมหาวิหาร มีประวัติความเป็นมายาวนาน เชื่อว่าเป็นที่ประดิษฐานพระบรมสารีริกธาตุขององค์พระโคตมพุทธเจ้า\n"
                +"\n" + "   องค์พระปฐมเจดีย์ เป็นพระเจดีย์ใหญ่ รูป ระฆังคว่ำ ปากผายมหึมา โครงสร้างเป็นไม้ซุง รัดด้วยโซ่เส้นมหึมาก่ออิฐ ถือปูน ประดับด้วยกระเบื้องปูทับ ประกอบด้วยวิหาร 4 ทิศ กำแพงแก้ว 2 ชั้น ถือเป็นเจดีย์ที่ใหญ่ที่สุด เป็นอันดับ 1 ของประเทศไทยอีกด้วย เป็นที่ประดิษฐานพระบรมสารีริกธาตุ ของพระพุทธเจ้า เป็นที่เคารพสักการบูชาของบรรดาพุทธศาสนิกชนทั่วโลก ทางวัดกำหนดให้มีงานเทศกาลนมัสการองค์พระปฐมเจดีย์ ในวันขึ้น 12 ค่ำ เดือน 12 ถึง วันแรม 5 ค่ำ เดือน 12 รวม 9 วัน 9 คืน เป็น ประจำทุกปี");
        cv.put(COL_IMAGE,"องพระ (1).jpg");
        db.insert(TABLE_NAME, null, cv);

        cv = new ContentValues();
        cv.put(COL_TITLE, "พระราชวังสนามจันทร์");
        cv.put(COL_LOCATION, "ตำบลพระปฐมเจดีย์ อำเภอเมืองนครปฐม จังหวัดนครปฐม 73000");
        cv.put(COL_DETAIL, "    พระราชวังสนามจันทร์ ตั้งอยู่ในตำบลพระปฐมเจดีย์ อำเภอเมืองนครปฐม จังหวัดนครปฐม ห่างจาก พระปฐมเจดีย์ ประมาณ 2 กิโลเมตร มีเนื้อที่ประมาณ 888 ไร่ 3 งาน 24 ตารางวา สร้างขึ้นโดย พระบาทสมเด็จพระมงกุฎเกล้าเจ้าอยู่หัว รัชกาลที่ 6 หลังจากพระองค์สวรรคต พระราชวังสนามจันทร์ใช้เป็นที่ทำการของส่วนราชการต่าง ๆ ของจังหวัดนครปฐม รวมทั้งเป็นวิทยาเขตหนึ่งของ มหาวิทยาลัยศิลปากร\n"
                +"\n" + "   ตั้งแต่วันที่ 1 เมษายน พ.ศ. 2561 พระราชวังสนามจันทร์ เปิดให้ประชาชนเข้ามาออกกำลังกาย ช่วงเช้า เวลา 5:00 – 8:00 น. และช่วงเย็น เวลา 16:00 – 20:00 น.");
        cv.put(COL_IMAGE,"สนามจันทร์ (1).jpg");
        db.insert(TABLE_NAME, null, cv);

        cv = new ContentValues();
        cv.put(COL_TITLE, "เมืองมายา หอภาพยนตร์");
        cv.put(COL_LOCATION, "94 หมู่ 3 ถนนพุทธมณฑล สาย 5 ต.ศาลายา อ.พุทธมณฑล จ.นครปฐม");
        cv.put(COL_DETAIL, "    หอภาพยนตร์ (องค์การมหาชน) (อังกฤษ: Film Archive (Public Organization)) เป็นหน่วยงานของรัฐ ซึ่งคล้ายกับหอสมุด พิพิธภัณฑ์ หอศิลป์ แต่เป็นหอสมุด พิพิธภัณฑ์ และหอศิลป์ ที่เก็บภาพยนตร์และวีดิทัศน์ ตลอดจนอะไรก็ตาม ที่เกี่ยวเนื่องกับภาพยนตร์และวีดิทัศน์ ทั้งนี้เพื่อ อนุรักษ์ไว้เป็นทรัพย์สินทางปัญญาและมรดกทาง ศิลปวัฒนธรรมของชาติ และนำออกบริการ ให้ประชาชนได้ศึกษา ค้นคว้าและชื่นชม หรือใช้ประโยชน์อย่างสะดวกและกว้างขวาง\n"
                +"\n" + "   ภาพยนตร์ เป็นสื่อแห่งการเรียนรู้ที่ดีที่สุดอย่างหนึ่งของมนุษย์ และอาจยังให้เกิดปัญญาได้ ภาพยนตร์จึงอาจเปรียบดังศาสนา หอภาพยนตร์ก็คือ วัด ซึ่งมีโรงหนังเป็นโบสถ์ มีพิพิธภัณฑ์เป็นวิหาร หรือเจดีย์ มีห้องเย็นเก็บรักษาฟิล์มเป็นหอไตร มีศูนย์ให้บริการ ค้นคว้าเป็นศาลาการเปรียญ ตราใหม่ของหอภาพยนตร์ คือ ธรรมจักรภาพยนตร์ ซึ่งหมุนวนไปเพื่อเผยแผ่สัจธรรม สำหรับมวลมนุษย์");
        cv.put(COL_IMAGE,"เมืองมายา (1).jpg");
        db.insert(TABLE_NAME, null, cv);

        //4
        cv = new ContentValues();
        cv.put(COL_TITLE, "ตลาดน้ำดอนหวาย");
        cv.put(COL_LOCATION, "หลังวัดดอนหวาย ริมแม่น้ำท่าจีน ตำบลบางกระทึก อำเภอสามพราน จังหวัดนครปฐม");
        cv.put(COL_DETAIL, "    ตลาดน้ำดอนหวายเป็นตลาดในจังหวัดนครปฐม ตั้งอยู่บนพื้นที่ของวัดคงคารามดอนหวาย หรือ วัดดอนหวาย ห่างจากวัดไร่ขิงประมาณ 5-6 กิโลเมตร\n"
                +"\n" + "   ตลาดน้ำดอนหวายเป็นสถานที่ท่องเที่ยวสำหรับการจับจ่ายซื้อของฝาก สิ้นค้าท้องถิ่น อาหาร เครื่องดื่ม การท่องเที่ยวทางน้ำ มีวัถีชีวิตเรียบง่าย บรรยากาศโดยรอบร่มรื่น มีพ่อค้าแม่ค้ามาตั้งร้านค้วาขอบของอยู่บริเวณสองฟาก มีเรือขายของมากมาย");
        cv.put(COL_IMAGE,"ตลาดน้ำดอนหวาย (1).jpg");
        db.insert(TABLE_NAME, null, cv);

        //5
        cv = new ContentValues();
        cv.put(COL_TITLE, "อุทยานแมลงเฉลิมพระเกียรติ พระบาทสมเด็จพระเจ้าอยู่หัว");
        cv.put(COL_LOCATION, "ศูนย์วิจัยและพัฒนากีฏวิทยาอุตสาหกรรม สถาบันวิจัยและพัฒนาแห่งมหาวิทยาลัยเกษตรศาสตร์ วิทยาเขตกำแพงแสน");
        cv.put(COL_DETAIL, "    อุทยานแมลงเฉลิมพระเกียรติพระบาทสมเด็จพระเจ้าอยู่หัว อุทยานแมลงในลักษณะของศูนย์ธรรมชาติศึกษา ศูนย์กลางที่ให้การศึกษา เป็นแหล่งที่จะให้ความรู้ความเข้าใจ ในลักษณะพิพิธภัณฑ์สถานธรรมชาติวิทยาในศาสตร์ทางกีฏวิทยา ชีววิทยา นิเวศวิทยา ตลอดจนการจำลองชีววิทยานั้น ฐานของความหลากหลายทางชีวภาพซึ่งจะสนองตอบและอำนวยประโยชน์ให้ กับนิสิต นักเรียน นักศึกษา นักวิชาการ ตลอดจนผู้สนใจทั่วไปในเขตภาคกลางตอนล่างและภาคตะวันตก\n"
                +"\n" + "   นอกจากนี้ในพื้นที่ดำเนินโครงการ ยังทำการค้นคว้าศึกษาวิจัยการเพาะเลี้ยงแมลงให้ผลผลิตบางชนิดที่มีศักยภาพในการที่จะพัฒนาในเชิงเศรษฐกิจ และการวิจัยการเพาะเลี้ยงแมลงที่สวยงามและหายากบางชนิด ที่ถูกจัดให้เป็นสัตว์ป่าคุ้มครองตามพระราชบัญญัติสงวนและคุ้มครองสัตว์ป่า พ.ศ. 2535 และอนุสัญญา CITES");
        cv.put(COL_IMAGE,"อุทยานแมลง (1).jpg");
        db.insert(TABLE_NAME, null, cv);

        //6
        cv = new ContentValues();
        cv.put(COL_TITLE, "เจษฏาเทคนิคมิวเซียม");
        cv.put(COL_LOCATION, "100 หมู่ 2 ตำบลงิ้วราย อำเภอนครชัยศรี จังหวัดนครปฐม");
        cv.put(COL_DETAIL, "เ   จษฎาเทคนิคมิวเซียมก่อเกิดจากความรักรถและยานหาหนะทุกชนิดของคุณเจษฎา เดชสกุลฤทธิ์ ที่มีมาตั้งแต่วัยเยาว์ เมื่อมีโอกาสได้เดินทางไปต่างประเทศบ่อย ๆ โดยเฉพาะประเทศในทวีปยุโรป สิ่งหนึ่งที่ไม่พลาดก็คือการเข้าเยี่ยมชมพิพิธภัณฑ์ยานยนต์ของแต่ละเมืองที่ไปเยือน จนวันหนึ่งเกิดความคิดที่ว่าเมืองไทยน่าจะมีพิพิธภัณฑ์แบบนี้บ้าง จึงเริ่มสะสมรถโบราณเมื่อประมาณ 20 กว่าปีก่อน\n"
                +"\n" + "   Jesada Technik Museum จัดแสดงยานพาหนะโบราณทั้งทางบก ทางน้ำ และทางอากาศ เปิดให้เข้าเยี่ยมชมโดยไม่เก็บค่าใช้จ่ายใด ๆ นอกจากนี้ยังจัดกิจกรรมภายนอกพิพิธภัณฑ์อย่างต่อเนื่อง อาทิ กิจกรรมเฉลิมพระเกียรติและเชิดชูสถาบันพระมหากษัตริย์ไทย กิจกรรมที่เป็นสาธารณประโยชน์ งานช่วยเหลือสังคม และส่งเสริมสนับสนุนการท่องเที่ยวของประเทศ");
        cv.put(COL_IMAGE,"เจษฎาเทคนิคมิวเซียม (1).jpg");
        db.insert(TABLE_NAME, null, cv);

        //7
        cv = new ContentValues();
        cv.put(COL_TITLE, "สวนนกยูง กวางดาว & แกะสามพราน");
        cv.put(COL_LOCATION, "สวนนกยูง กวางดาว&แกะสามพราน ต.อ้อมใหญ่ อ.สามพราน จ.นครปฐม");
        cv.put(COL_DETAIL, "    สวนนกยูงสามพราน เป็นสถานที่ท่องเที่ยวใหม่ของนครปฐมที่เพิ่งเปิดได้ไม่นาน โดยเริ่มเปิดดำเนินการเมื่อ ปีพ.ศ.2555 มีวัตถุประสงค์เพาะพันธุ์นกยูงสายพันธุ์ต่างๆไม่ว่าจะเป็นนกยูงไทยหรือนกยูงอินเดีย หลังจากนั้นมีผู้สนใจเข้าชมจำนวนมาก จึงกลายเป็นจุดเริ่มต้นของสวนนกยูงสามพรานแห่งนี้ ที่สวนนกยูงสามพรานมีนกยูงอยู่ที่นี่มากกว่า 1,000 ตัว\n"
                +"\n" + "   โดยนักท่องเที่ยวสามารถเที่ยวชมได้อย่างใกล้ชิด สามารถเปิดกรงเข้าไปชมเพื่อให้อาหาร ปัจจุบันสวนนกยูงสามพรานนอกจากจะมีนกยูงแล้ว  ยังมีสัตว์ให้เยี่ยมชมอื่นๆอีกมากมาย  อาทิเช่น นกยูง, กวางดาว  แกะ  ปลาคาร์ฟ และสัตว์ปีกประเภทอื่น ๆ   โดยนักท่องเที่ยวสามารถซื้ออาหารซึ่งเป็นขนมปัง สัตว์ทุกตัวสามารถกินได้");
        cv.put(COL_IMAGE,"สวนนกยูง (1).jpg");
        db.insert(TABLE_NAME, null, cv);

        //8
        cv = new ContentValues();
        cv.put(COL_TITLE, "แอร์ออร์คิดส์ & แล็ป");
        cv.put(COL_LOCATION, "แอร์ออร์คิดส์ & แล็ป เลขที่ 23/1 หมู่ 3 ต.นราภิรมย์ อ.บางเลน จ.นครปฐม");
        cv.put(COL_DETAIL, "    แอร์ออร์คิดส์ เป็นสวนกล้วยไม้ชื่อดังของจังหวัดนครปฐมและเป็นซูเปอร์มาเก็ตกล้วยไม้แห่งแรกของประเทศไทย เป็นสถานที่ท่องเที่ยวเชิงเกษตรที่อยู่ไม่ไกลจากกรุงเทพฯ ตั้งอยู่อำเภอบางเลน ภายในแอร์ออร์คิดส์ด้านหน้าเป็นซูเปอร์มาเก็ตกล้วยไม้ที่ลูกค้าสามารถเลือกหยิบเลือกซื้อกล้วยไม้บนรถเข็นได้เองตามใจชอบ มีกล้วยไม้หลายสกุล อาทิ สกุลหวาย แวนด้า ฯ มีกล้วยไม้พันธุ์พระนาม “ชมพูนครินทร์” และ กล้วยไม้พันธุ์พระนาม “โสมสวลี” ให้ได้ชม หรือสามารถสั่งกระเช้าต้นกล้วยไม้สวยๆจากแอร์ออร์คิดส์เพื่อไปเป็นของฝากผู้ใหญ่ก็ยังได้\n"
                +"\n" + "   กล้วยไม้ภายในแอร์ออร์คิดส์ จำหน่ายปลีกและส่งทั้งในและต่างประเทศ เป็นสวยกล้วยไม้ที่ทั้งใหญ่และสะอาดสะอ้าน นักท่องเที่ยวสามารถเดินชมด้านในเพื่อที่จะเห็นวิธีการเพาะพันธุ์ การแพคส่งจำหน่ายอย่างใกล้ชิด ด้านในสุดของแอร์ออร์คิดส์เป็นสวนที่ใช้เพาะปลูกขนาดใหญ่สุดลูกหูลูกตา นอกจากนั้นยังมีร้านกาแฟภายในสวนให้นักพักเล่นอีกด้วย แอร์ออร์คิดส์ เป็นสวนกล้วยไม้ที่ออกสื่อมาแล้วหลายรายการ อาทิ SME ตีแตก หรือ อายุน้อยร้อยล้านเป็นต้น");
        cv.put(COL_IMAGE,"แอร์ออร์คิดส์ (1).jpg");
        db.insert(TABLE_NAME, null, cv);

        //9
        cv = new ContentValues();
        cv.put(COL_TITLE, "ตลาดน้ำทุ่งบัวแดง");
        cv.put(COL_LOCATION, "ตำบล บางเลน อำเภอ บางเลน นครปฐม");
        cv.put(COL_DETAIL, "    ตลาดน้ำทุ่งบัวแดง ณ บางเลน ตั้งอยู่ในอำเภอเมืองบางเลน จังหวัดนครปฐม เป็นตลาดน้ำที่ไม่เหมือนกับที่ไหน เพราะตั้งอยู่ริมสระบัวกว้างใหญ่ บรรยากาศสวยงาม ที่นี่มีเนื้อที่ทั้งหมดราว ๆ 44 ไร่ แบ่งเป็นโซนต่าง ๆ อย่างชัดเจน โดยเฉพาะบริเวณสระบัวที่มีกว้างขวางมากถึง 24 ไร่ ซึ่งนักท่องเที่ยวสามารถที่จะมาเที่ยวชมบัวแดงได้ตลอดทั้งปี เพราะบัวที่นี่มีอยู่ 2 สายพันธุ์ คือ บัวสายพันธุ์ดั้งเดิม และ บัวแดงมะเหมี่ยว\n"
                +"\n" + "   ใครอยากจะมาพายเรือชมบัวแดงและสูดอากาศบริสุทธิ์ในยามเช้าก็ได้ หรือจะมาเที่ยว มานั่งพักกินข้าว ดื่มกาแฟมองบัวแดงยามบ่ายก็ดี ยิ่งถ้าเป็นช่วงเย็นที่พระอาทิตย์ตกดิน บรรยากาศก็จะยิ่งโรแมนติกขึ้นไปอีกเท่าตัว");
        cv.put(COL_IMAGE,"ตลาดน้ำทุ่งบัว (1).jpg");
        db.insert(TABLE_NAME, null, cv);

        //10
        cv = new ContentValues();
        cv.put(COL_TITLE, "ตลาดน้ำลำพญา");
        cv.put(COL_LOCATION, "วัดลำพญา ตำบลลำพญา อำเภอบางเลน จังหวัดนครปฐม");
        cv.put(COL_DETAIL, "    ตลาดน้ำวัดลำพญา คือ แหล่งท่องเที่ยวชนบท ที่เน้นวิถีชีวิตชุมชนริมน้ำ ประเพณี วัฒนธรรมท้องถิ่น คลังสมองภูมิปัญญาและปราชญ์ชาวบ้าน เพื่อให้สืบทอดสู่อนุชนรุ่นหลังต่อไป \n"
                +"\n" + "   ชื่อ ลำพระยา มีที่มาจากนามเดิมของหมู่บ้านในครั้งที่การปกครอง ยังเป็นอำเภอ บางปลา มณฑลนครชัยศรี ลักษณะตลาดมีทั้งบนบก ในเรือ แพ คนขายเป็นคนในชุมชนประมาณ 70-80 % นอกพื้นที่ 20%");
        cv.put(COL_IMAGE,"ตลาดน้ำลำพญา (1).jpg");
        db.insert(TABLE_NAME, null, cv);

    }

    @Override
    public void onUpgrade(SQLiteDatabase db, int oldVersion, int newVersion) {

    }
}
